Revit 2027 API
ParameterTypeId.StructuralAttachmentStartLevelReference Property
 "Start Attachment Level Reference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentStartLevelReference { get; }
Public Shared ReadOnly Property StructuralAttachmentStartLevelReference As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentStartLevelReference {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentStartLevelReference : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace